# coding:utf-8

SourceMap = {
    # 养生
    "dzys": '17',
    "cnk": '17',
    "whc": '17',
    "ttys": '17',
    # 汽车之家
    "ah": '17',
    # 军事
    "zhm": '18',
    "snm": '18',
    "hqm": '18',
    "ppm": '18',
    "shm": '18',
    "51m": '18',
    "gfm": '18',
    "xhm": '18',
    # 国际在线
    "cri": "20",
    # 中投
    "chn": "21",
    # 东方头条图文
    "edn": "23",
}

CategoryMap = {
    # 大众养生
    "dzys": {
        u"健康": u"健康",
        u"养生": u"健康",
    },
    # cnk
    "cnk": {
        u"健康": u"健康",
    },
    # 女性健康网
    "whc": {
        u"健康": u"健康",
    },
    # 天天养生
    "ttys": {
        u"健康": u"健康",
    },
    # 汽车之家
    "ah": {
        u"汽车": u"汽车",
    },
######## 军事
    # 中华网军事
    "zhm": {
        u"中国军情": u"中国军情",
        u"国际军情": u"国际军情",
        u"航空航天": u"航空航天",
        u"军史秘闻": u"军史秘闻",
        u"军事酷图": u"兵器解析",
        u"军事评论": u"军事杂谈",
    },
    # 新浪军事
    "snm": {
        u"中国军情": u"中国军情",
        u"东海局势": u"中国军情",
        u"南海局势": u"中国军情",
        u"国际军情": u"国际军情",
        u"大国博弈": u"国际军情",
        u"军史回眸": u"军史秘闻",
        u"军事深度": u"军事杂谈",
    },
    # 环球军事
    "hqm": {
        u"国内": u"中国军情",
        u"台海": u"中国军情",
        u"国际": u"国际军情",
        u"军事": u"兵器解析",
    },
    # 人民网军事
    "ppm": {
        u"中国军情": u"中国军情",
        u"国防部": u"中国军情",
        u"国际军情": u"国际军情",
        u"军史": u"军史秘闻",
        u"名家论剑": u"兵器解析",
    },
    # 搜狐军事
    "shm": {
        u"国防观察": u"中国军情",
        u"环球军事": u"国际军情",
        u"史海迷云": u"军史秘闻",
        u"兵器解析": u"兵器解析",
        u"军事杂谈": u"军事杂谈",
    },
    # 51军事观察室
    "51m": {
        u"国内": u"中国军情",
        u"国际": u"国际军情",
    },
    # 国防部
    "gfm": {
        u"武装力量": u"中国军情",
        u"军事外交": u"国际军情",
        u"军事行动": u"国际军情",
    },
    # 新华网军事
    "xhm": {
        u"中国": u"中国军情",
        u"世界": u"国际军情",
    },
######## 国际在线
    "cri": {
        u"娱乐": u"娱乐",
        u"要闻": u"要闻",
    },
######## 中投
    "chn": {
        u"非凡娱乐": u"娱乐",
        u"正在上演": u"娱乐",
        u"手机电影": u"娱乐",
        u"传畅传媒": u"娱乐",
        u"体育资讯": u"体育",
        u"大众体育": u"体育",
        u"崇学向善": u"文化",
        u"明德化成": u"文化",
        u"创新中国": u"国内",
        u"美食中国": u"美食",
    },
######## 东方头条图文
    "edn": {
        u"推荐": u"推荐",
        u"互联网": u"互联网",
        u"娱乐": u"娱乐",
        u"八卦": u"八卦",
        u"体育": u"体育",
        u"CBA": u"体育",
        u"德甲": u"体育",
        u"意甲": u"体育",
        u"网球": u"体育",
        u"中超": u"体育",
        u"西甲": u"体育",
        u"英超": u"体育",
        u"棋牌": u"体育",
        u"高尔夫": u"体育",
        u"排球": u"体育",
        u"羽毛球": u"体育",
        u"社会": u"社会",
        u"外汇": u"财经",
        u"保险": u"财经",
        u"不动产": u"财经",
        u"黄金": u"财经",
        u"新三板": u"财经",
        u"股票": u"财经",
        u"期货": u"财经",
        u"基金": u"财经",
        u"理财": u"财经",
        u"科技": u"科技",
        u"汽车": u"汽车",
        u"国际": u"国际",
        u"军事": u"军事",
        u"健康": u"健康",
        u"保健": u"保健",
        u"健身": u"健身",
        u"减肥": u"减肥",
        u"时尚": u"时尚",
        u"数码": u"数码",
        u"家居": u"家居",
        u"饮食": u"美食",
        u"游戏": u"游戏",
        u"人文": u"文化",
        u"星座": u"星座",
        u"电影": u"电影",
        u"科学": u"科学",
        u"国内": u"国内",
        u"笑话": u"笑话",
        u"电视": u"电视剧",
    }
}
